Revit 2027 API
ElectricalSystem.ApparentCurrentPhaseC Property
 The ApparentCurrentPhaseC value of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ApparentCurrentPhaseC { get; }
Public ReadOnly Property ApparentCurrentPhaseC As Double
	Get
public:
property double ApparentCurrentPhaseC {
	double get ();
}
member ApparentCurrentPhaseC : float with get
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the ApparentCurrentPhaseC value of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace